/*
                       __
                     .'  '.
                 _.-'/  |  \
    ,        _.-"  ,|  /  0 `-.
    |\    .-"       `--""-.__.'=====================-,
    \ '-'`        .___.--._)=========================|
     \            .'      |                          |
      |     /,_.-'        |    Autor:Jorge_Slime     |
    _/   _.'(             |    Created: 12.06.2023   |
   /  ,-' \  \            |    Time: 11.11.07        |
   \  \    `-'            |                          |
    `-'                   '--------------------------'

- "No bajes tus sueños a la altura de tus capacidades aparentes, sino haz que
   estas se eleven hasta llegar a la altura de tus sueños."

- "Do not Ler your dreams to the height of your apparent capabilities, but make
   them rise to the height of your dreams." 

- "Не опускайте свои мечты до высоты своих видимых возможностей, но заставляйте
   их подниматься до высоты ваших мечтаний."

- "自分の見かけの能力の高さに夢を下げないで、夢の高さに上げてください。"
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⣦⣄⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣴⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⣿⣿⣿⣿⣿⣶⠂⣀⣀⣀⣤⣴⣾⣿⣿⣿⣿⣿⣟⢦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⣿⣿⣿⣿⣿⠇⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡷⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⣿⣿⣿⣿⡿⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣜⡿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⣿⣿⣿⣿⠇⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⠛⠿⣿⣿⣿⣿⣿⣿⣿⣮⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⠚⢳⡓⠲⢛⣳⠀⣳⠚⢳⠖⢻⡄⢠⠞⠳⡆⠀⠀⠀⠀⠀⠀⠀⠀
⣿⣿⣿⡿⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⢀⣤⣴⠿⣿⡿⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣓⣚⠀⣾⣉⣽⠀⣻⠀⢸⡄⢸⡇⠸⣏⣍⡯⠀⠀⠀⠀⠀⠀⠀⠀
⣿⣿⣿⠁⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡌⢻⣷⣾⣟⣽⣿⣝⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢾⣍⣩⠗⠈⠉⠈⠀⠈⠀⠈⠀⠈⠁⠀⠈⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠉⠛⠛⠀⠙⠻⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣞⡛⠋⣾⣿⡿⢻⡈⠻⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣄⣀⣠⣄⣀⣀⣤⣤⣀⣠⣄⣄⣤⣴⣀⣀⣄⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠻⢿⣿⣿⣿⣿⣿⣿⣦⡉⠉⠀⠚⣿⣁⡉⠿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠙⠋⠚⠛⠊⠀⠋⠋⠛⠚⠙⠙⠋⠛⠛⠛⠛⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠛⢿⣿⣿⣿⣷⡄⣴⣾⣿⣿⣿⣧⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⣿⣿⠹⢿⣿⣿⣿⣣⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣿⡿⢠⣿⣿⣿⣷⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⣿⣷⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣶⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣿⢿⣟⣧⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣯⣿⡿⠾⠟⠛⠋⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣤⣤⣤⣤⣤⣤⣤⣤ ⠀⠀⠀⠀⠀⠀⠀⣤⣤⣤⣤⣤⣤⣤⣤⡄⠀⠀⠀⠀⠀⠀⠀⢠⣤⣤⣤⣤⣤⣤⣤⣄⠀⠀⠀⠀⠀⠀⠀  ⣤⣤⣤⣤⣤⣤⣤⣤⠀
⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣿⣿⣷
⣠⣀⣄⣠⣤⠼⠟⠿⠻⠛⠿⠻⠿⠻⣥⣀⣤⣀⣄⣤⣄⣼⠟⠿⠛⠟⠟⠻⠿⣤⣠⣄⣄⣠⣠⣄⣄⡿⠻⠟⠟⠻⠟⠻⠟⠿⢦⣄⣠⣄⣠⣀⣄⣤⣸⡿⠻⠟⠿⠻⠟⠿
⣿⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⣿⣿⣿⣿⣿⣿⣷⡀⠀⠀⠀⠀⠀
⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣄⠀⠀⠀⠀
⠀⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⣿⣿⣿
⠀⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿
⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿


*/

#include <bits/stdc++.h>
using namespace std;  

#define XD() (ios_base::sync_with_stdio(false),cin.tie(NULL));

#define ExecuteTime   cerr << "Time elapsed: " << 1.0 * clock() / CLOCKS_PER_SEC << " s.\n"

#define LN                                                           '\n'
#define yes                                                 cout<<"YES\n"
#define no                                                   cout<<"NO\n"
#define sz(x)                                        (long long) x.size()
#define all(x)                                         x.begin(), x.end()

#define forn(i, n)                            for (auto i = 0; i <n; i++)
#define for1(i, n)                           for (auto i = 1; i <=n; i++)
#define fore(i, v)                                         for(auto &i:v)
#define loop(a,b,c)                            for(auto a = b; a <c; a++)
#define loop1(a,b,c)                           for(auto a = b; a<=c; a++)
#define rloop(a,b,c)                           for(auto a = b; a >c; a--)
#define in(v)                                      for(auto &i:v) cin>>i;
#define ou(v)                                for(auto &i:v) cout<<i<<" ";
#define mem(a, h)                               memset(a, (h), sizeof(a))

#define pb(i)                                                push_back(i)
#define eb(i)                                             emplace_back(i)
#define fs                                                          first
#define sd                                                         second
#define mp                                                      make_pair

/*==========================================================================================*/

typedef                                                     long long ll;
typedef                                           unsigned long long ull;
typedef                                                        double dd;
typedef                                              pair<int, int>  pii;
typedef                                                 vector<pii > vii;
typedef                                                   vector<int> vi;
typedef                                            vector<long long> vil;
typedef                                               vector<string> vis;
typedef                                                 vector<char> vic;

/*==========================================================================================*/
//solo trabaja con enteros.
ll abs_(ll x){return (x < 0 ? -x : x);}
ll max_(ll a,ll b) {return (a > b ? a : b);}
ll min_(ll a,ll b) {return (a < b ? a : b);}

//Generate ramdomic numbers
/*==========================================================================================*/

mt19937 rng((uint32_t)chrono::steady_clock::now().time_since_epoch().count());

/*==========================================================================================*/
//Constants

const int MOD=1000000007;
const int MX=INT_MAX;
const dd PI = acos(-1);
const int INF=1000001;
/*==========================================================================================*/
//ssj
ll ff,ul,x,F=0; 
string ss; 
void solve(){
    int n;cin>>n; 
    F=0; 
    ss=""; 
    for(int j=0;j<n;++j){ 
        cin>>x; 
        if(j==0){ul=x;ff=x;ss+='1';} 
        else if(!F && x>=ff && ul<=x){ul=x;ss+='1';} 
        else if(!F && x<=ff && ul>x){F=1;ul=x; ss+='1';} 
        else if(F && x>=ul && x<=ff){ul=x;ss+='1';} 
        else ss+='0'; 
    } 
    cout<<ss<<LN;
}
signed main() {
    XD();
    ll TT=1;
    cin>>TT;
    for(;TT--;) solve();
    return 0;
} 